Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་སྡེ་ཉི་མའི་སྙིང་པོ་ཞེས་བྱ་བའི་མདོ།
en: The Noble Very Extensive Sūtra The Quintessence of the Sun

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པ་ན་བཞུགས་ཏེ། གང་དག་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ནས་དེར་ལྷགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད། དཔག་ཏུ་མེད། བརྗོད་དུ་མེད་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་སོ།
en: The Blessed One was residing in the Veṇuvana at the Kalandakanivāpa near Rājagṛha, surrounded and attended by an innumerable, limitless, and indescribable number of bodhisattva great beings who had arrived from countless other buddha realms of the ten directions.

source: །དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དང་གཞན་དག་ནས་དེར་འདུས་ཏེ་ལྷགས་པའི་ཉན་ཐོས་ཆེན་པོ་གྲངས་མེད། དཔག་ཏུ་མེད། བརྗོད་དུ་མེད་པ་དག་གིས་ཀྱང་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་སོ།
en: He was also surrounded and attended by an innumerable, limitless, and indescribable number of great hearers who had gathered there from different buddha realms of the ten directions.

source: །དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དང་གཞན་དག་ནས་འདིར་ལྷགས་པ་བརྒྱ་བྱིན་དང་། ཚངས་པའི་དབང་པོ་དང་། ལྷའི་དབང་པོ་དང་། ཀླུའི་དབང་པོ་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་དང་། དྲི་ཟའི་དབང་པོ་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་དང་། ནམ་མཁའ་ལྡིང་གི་དབང་པོ་དང་། མི་འམ་ཅིའི་དབང་པོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་གྲངས་མེད། དཔག་ཏུ་མེད། བརྗོད་དུ་མེད་པ་དག་གིས་ཀྱང་མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ས་དང་ནམ་མཁའ་ལ་འགྲོ་བའི་ལམ་གང་བར་གྱུར་ཏོ།
en: In the same way, an innumerable, limitless, and indescribable number of other beings who had arrived there from the various buddha realms of the ten directions—Śakra, Lord Brahmā, the rulers of the gods, the rulers of the nāgas, the rulers of the yakṣas, the rulers of the gandharvas, the rulers of the asuras, the rulers of the garuḍas, the rulers of the kinnaras, and the rulers of the mahoragas—filled all the pathways on the ground and in the sky throughout the entire buddha realm of Sahā.

source: །དེ་བཞིན་དུ་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷ་གཞན་དང་གཞན་དག་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གཞན་དང་། གཞན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ཀྱང་ལྷགས་ནས།
en: There also arrived an innumerable and limitless number of different gods from the desire and form realms, of nāgas, yakṣas, and rākṣasas, and of asuras, garuḍas, kinnaras, and mahoragas.

source: བཅོམ་ལྡན་འདས་ལ་གྱེན་དུ་ལྟ་ཞིང་། བཅོམ་ལྡན་འདས་རིང་པོ་མི་ཐོགས་པར་མཐར་ཕྱིན་པ། ནམ་མཁའ་ལྟར་སྣང་བ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རབ་ཏུ་འབྱེད་པ། དབུགས་རྔུབ་པ་དང་། འབྱུང་བ་དྲན་པ་འཆི་བ་མེད་པའི་སྒོ།
en: Sitting in silence, they looked up at the Blessed One as he revealed how bodhisattva conduct quickly brings perfection and manifests like space and as he gave teachings on the mindfulness of breathing, which is the gateway to immortality, and the sublime states.

source: ཚངས་པའི་གནས་པ་ལུང་བསྟན་པ་སྟོན་པ་ན་ཅང་མི་སྨྲ་བར་འཁོད་དེ་ཐམས་ཅད་དང་ལྡན་པའི་མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ས་དང་ནམ་མཁའི་ལམ་གང་བར་གྱུར་ཅིང་།
en: They filled all the pathways on the ground and in the sky throughout the entire buddha realm of Sahā.

source: ད་དུང་བཅོམ་ལྡན་འདས་ཀྱི་ཆོས་ཀྱི་ཆར་གྱི་སྟོན་པས་ཚིམ་པར་མ་གྱུར་ནས་ཐལ་མོ་དག་རབ་ཏུ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ཁོ་ན་ལ་བལྟ་ཞིང་འཁོད་པ་ནི་དཔེར་ན་ནད་པ་དག་སྨན་པ་ལ་ལྟ་བར་བྱེད་པ་བཞིན་དང་།
en: Still not satisfied by the teachings of the Blessed One’s Dharma rain, they remained with their palms joined together, staring at the Blessed One.

source: མུན་པས་ཁེབས་པ་དག་སྣང་བ་ལ་ལྟ་བར་བྱེད་པ་བཞིན་དང་། ཆུ་བོས་ཁྱེར་བ་དག་ཆུ་འགྲམ་དུ་ལྟ་བར་བྱེད་པ་བཞིན་དང་། སྡུག་བསྔལ་བར་གྱུར་པ་དག་སྐྱབས་ལ་ལྟ་བར་བྱེད་པ་བཞིན་ཏེ།
en: They beheld him like sick persons seeing the doctor, or like beings engulfed in darkness seeing a source of light, or like beings carried off by a river looking at the riverbank, or like afflicted beings looking at a refuge from their suffering.

source: དེ་ལྟར་མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ས་དང་ནམ་མཁའི་ལམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་དང་། ཉན་ཐོས་དག་དང་། དབང་པོ་བརྒྱ་བྱིན་དག་ནས་ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་དག་གི་བར་དང་། འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷ་གཞན་དང་གཞན་དག་ནས་མི་དང་མི་མ་ཡིན་པ་རྣམས་གཞན་དང་གཞན་དག་གི་བར་བཅོམ་ལྡན་འདས་ཆོས་དང་ལྡན་པ་ཆོས་ཀྱི་རྒྱལ་པོ་ལ་ལྟ་ཞིང་ཐལ་མོ་རབ་ཏུ་སྦྱར་ཏེ་ཅང་མི་སྨྲ་བར་འཁོད་པར་གྱུར་ཏོ།
en: In that way, filling all the pathways on the ground and in the sky throughout the entire buddha realm of Sahā, the bodhisattva great beings and the hearers as well as Lord Śakra and everyone else up to the lords of the mahoragas, the different gods from the desire and form realms, and the various humans and nonhuman beings were sitting silently with their palms joined together, looking at the Blessed One, the righteous King of the Dharma.

source: །དེའི་ཚེ་ཚངས་པ་ཆེན་པོ་པད་མ་འབར་བའི་དཔལ་ཞེས་བྱ་བ་སངས་རྒྱས་མང་པོ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ།
en: Present at that time was a mahābrahmā named Glorious Blazing Lotus. He had generated roots of virtue under many buddhas and would no longer regress on the path to unsurpassed and perfect awakening.

source: ཆོས་ལ་དམིགས་པའི་བྱམས་པ་ཤིན་ཏུ་ཡོངས་སུ་སྦྱང་བ་བྱས་པར་གྱུར་ཏོ།
en: He had also thoroughly trained in love by observing phenomena.

source: །དེ་ནས་ཚངས་པ་ཆེན་པོ་པད་མ་འབར་བའི་དཔལ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: This mahābrahmā Glorious Blazing Lotus then stood up, draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་བརྗོད་པ་འདིས་ཆོས་བཤད་པར་གསོལ་བ་བཏབ་བོ།
en: Bowing down with his palms joined together in the direction of the Blessed One, with these verses he supplicated him to expound the Dharma:

source: །རིང་དུ་གཤེགས་ཤིང་མྱུར་བའི་རྒྱུན་དང་ལྡན།
en: “You have reached far and possess a swift course.

source: །ཟད་པ་ལྷུར་མཛད་མི་གཡོ་འོད་གསལ་བ།
en: Dedicated to exhaustion, you are immutable and luminous.

source: །རྟོགས་པ་ཐམས་ཅད་སྐྱེད་པར་མཛད་པ་པོ། །ཁྱོད་གསུང་རབ་ཞི་རྒྱུ་སྐར་ཚུལ་མཁྱེན་མཁས།
en: You generate all forms of realization, your speech is utterly peaceful, And you are an expert in the ways of the stars.

source: །དབུགས་རྔུབ་པ་དང་འབྱུང་བ་དྲན་པ་མཁྱེན།
en: “You master the mindfulness of breathing,

source: །ཚངས་པའི་གནས་པ་བཞི་པོ་དག་དང་ལྡན།
en: You are endowed with the four sublime states,

source: །སྲིད་པ་གསུམ་པོ་ཇི་ལྟར་དག་འགྱུར་བར། །སེམས་ཅན་འགྲོ་བ་སྤོང་བར་མཛད་པ་པོ།
en: And you cause sentient beings to abandon the destinies of rebirth In a way that purifies the three realms.

source: །ཚུལ་གཅིག་ལྡན་པ་ཉིད་ཀྱི་མཁྱེན་མངའ་བ།
en: “You possess the knowledge of the single mode,

source: །ལྷ་མི་རྣམ་པ་མང་པོ་ཁྲི་དག་ཀྱང་།
en: You eliminate the doubts of tens of thousands of gods and humans,

source: །སོམ་ཉི་རྒལ་མཛད་དགེ་བརྙེས་ཆུ་བོ་རྒལ།
en: You have attained goodness, you have crossed the flood,

source: །བདེ་འགྲོའི་མཁྱེན་པ་མྱུར་དང་ལྡན་པ་པོ།
en: And you are endowed with the swift knowledge that leads to happiness.

source: །བྱང་ཆུབ་སྤྱོད་དང་སངས་རྒྱས་ཆོས་མངོན་སུམ།
en: “Your awakened conduct and buddha qualities are manifest,

source: །སེམས་གཡོ་སེམས་ཅན་ཁ་ཅིག་འདོད་ཀླུང་ལྷུང་། །མུན་པས་ཁེབས་ཤིང་མིག་དང་མི་ལྡན་པའི། །སྡུག་བསྔལ་ཐམས་ཅད་བཅོམ་པར་གྱུར་ལགས་པ།
en: And you have conquered the entirety of the suffering of those beings with agitated minds Who are blind, engulfed in darkness, And carried away by the river of desire.

source: །མ་ཐོས་དགེ་བྲལ་སློབ་དཔོན་མཁས་ལྡན་པའི། །སྐྱེ་བོ་བྲལ་ལ་མི་དབང་ཐུགས་རྗེ་སྐྱེད།
en: “Lord of humankind, you manifest compassion for those who have not studied And for those who are bereft of virtue and separated from skilled teachers.

source: །མཉམ་པའི་ཆོས་ཉན་སྐྱེ་བའི་ཕ་རོལ་མཆི། །སྲིད་པ་གཅོད་པ་བཤད་པར་མཛད་དུ་གསོལ།
en: Please let us hear about the Dharma of sameness; Explain how to pass beyond birth and sever saṃsāra!

source: །སྐྱེ་ཀླུང་ཕ་རོལ་གཤེགས་ཐུབ་ཐུགས་རྗེས་གསུངས།
en: “Great sage, you have crossed the river of birth; please speak with compassion!

source: །བློ་འཆལ་སྐྱེ་མང་སྲེད་པའི་དྲ་བའི་ལམ།
en: Due to their distorted minds, beings will wander for many lifetimes

source: །དེ་དག་ཐམས་ཅད་ཉོན་མོངས་རྩ་བ་ཅན། །དེར་ནི་སེམས་ཅན་འཁྱམས་འགྱུར་གཅད་དུ་གསོལ།
en: On those paths that are webs of craving and contain the roots of afflictions; Please sever them all!

source: །གང་དུ་སྡུག་བསྔལ་རབ་ཞི་དབང་དྲུག་དང་། །ཡིད་ཀྱང་ཞི་འགྱུར་སྲེད་སྐྱོན་རྒྱལ་བ་གསུང་།
en: “Victor, please tell us about the defects of craving, So that our suffering is pacified along with our six senses and our minds.

source: །སྲེད་པ་བྲལ་བ་སྲེད་རྒྱུ་མི་མངའ་བ། །སེམས་ཅན་གདུང་བ་དཔལ་ཀུན་བྲལ་གྱུར་པ།
en: Great sage, in order for beings to be free from craving and its causes And from the abundance of their torments,

source: །དེ་སླད་ཐུབ་པ་ཐུགས་བརྩེ་བ་ཡི་རྒྱུས།
en: “Please expound to us, out of your affection,

source: །སྲེད་པ་ཡི་ནི་ཆུ་ཀླུང་སྐེམས་མཛད་པ།
en: The Dharma that dries up the river of craving,

source: །མྱུར་དུ་བདེ་ཞིང་འཆི་བ་མ་མཆིས་པའི།
en: Swiftly leads to happiness and immortality,

source: །ཆོས་ཀྱང་སྲེད་པ་གཅོད་པ་བཤད་པར་གསོལ།
en: And eliminates craving!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚངས་པ་པད་མ་འབར་བའི་དཔལ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One replied to the mahābrahmā Glorious Blazing Lotus:

source: །གང་དག་སྔོན་ཆད་ཕ་རོལ་ཕྱིན། །སྤྱོད་པ་སྤྱད་ཅིང་སྤྱོད་འགྱུར་བ། །དེ་དག་ཉན་ཐོས་ཆོས་རྣམས་ལ། །ནམ་ཡང་དགའ་བར་མི་བྱ་སྟེ།
en: “Those who have practiced the perfections in the past And will practice them in the future Should never delight In the teachings of the hearers.

source: །སངས་རྒྱས་ཆོས་ལས་ཉམས་འགྱུར་བའི། །ལྟུང་བ་གཉིས་པ་གཞན་མེད་དེ།
en: “There is no other downfall besides that, To corrupt the teaching of the buddhas.

source: །དེ་ནི་ཡང་དང་ཡང་དུ་ཡང་། །གཉི་གར་སེམས་ནི་འཇུག་པ་ཡིན།
en: Yet the mind engages repeatedly, Again and again, in such duality.

source: །ཁྲོ་དང་ཉན་ཐོས་ཆོས་རྣམས་དང་། །རྐྱེན་གྱི་བྱང་ཆུབ་འཇུག་པ་ཡི། །ཆོས་གསུམ་རྣམ་པར་སྤངས་པས་ན།
en: “By abandoning the three types of teachings— Those associated with aggression, The teaching of the hearers, and conditioned awakening—

source: །སངས་རྒྱས་ཆོས་རྣམས་རྫོགས་པར་འགྱུར།
en: One will perfect the qualities of the buddhas.

source: །སྐྱེ་གནས་བཞི་ལྡན་སེམས་ཅན་འདི།
en: “Those beings, born in one of the four ways,

source: །སངས་རྒྱས་ཞིང་འདིར་ལྷགས་པ་དག །ཐམས་ཅད་འདོད་པ་རྟེན་མི་བྱེད།
en: Who have arrived in this buddha realm Are all free from indulging in desire,

source: །ཐམས་ཅད་མི་སྡུག་ཐོབ་པ་ཡིན།
en: And all of them have attained insight into repulsiveness.

source: །འདི་ན་སེམས་ཅན་མཁས་པ་གང་།
en: “The wise beings present here

source: །བྱང་ཆུབ་མཆོག་གི་ཕྱིར་ཞུགས་ཤིང་། །གང་བློ་གཟུངས་དང་བཟོད་པ་ལ། །བརྩོན་ཞིང་ལེགས་པར་གོམས་བྱས་ལ།
en: Who follow the path to supreme awakening, Who exert themselves and are well trained In retention and patience,

source: །དབང་པོ་དྲུག་གི་སྒོ་བསྡམས་ཤིང་། །སྐྱིལ་མོ་ཀྲུང་གིས་དྲན་གཞག་ནས། །རང་གི་སྤྱོད་ཡུལ་ས་ནོན་པ།
en: “Whose six sense doors are restrained, And who have mastered their senses By applying mindfulness cross-legged

source: །ཕྱི་མའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས།
en: Will be the future thus-gone ones.

source: །ནོར་བདུན་རབ་ཏུ་རྫོགས་པའང་ཡིན།
en: “They will also perfect the seven riches.

source: །འདིར་ནི་མི་སྡུག་ཚུལ་བཤད་ན།
en: If I explain the way of repulsiveness here,

source: །ཀུན་གཞི་གང་ཡིན་སེམས་ཅན་གྱི། །འཆིང་བ་བརྟན་པ་འདིར་བཅད་འགྱུར།
en: Then the basis for all, the constant that binds beings, Will be severed.

source: །ངས་ནི་ཆོས་ཀྱི་སེར་སྣ་སྤངས།
en: “I have relinquished miserliness regarding the Dharma,

source: །སེམས་ཅན་སྲུང་ཕྱིར་མ་བཤད་དེ།
en: Yet, in order to protect beings, I have not explained this.

source: །འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཡིས། །བྱང་ཆུབ་ཕྱིར་སེམས་འདིར་མ་བཏང་།
en: Still, for the sake of awakening, Bodhisattvas will never give up this attitude.

source: །ཕྱོགས་བཅུའི་སངས་རྒྱས་དེ་དག་གིས། །ཆོས་འདི་ཡུན་རིང་གནས་བྱ་ཞེས། །ས་འདི་ཡོངས་སུ་སྤྱད་མཛད་ཅིང་། །ས་འདི་བྱིན་གྱིས་བརླབས་པ་ཡིན།
en: “The buddhas of the ten directions Have subsisted on this earth and blessed it As they declared, ‘This Dharma must remain for a long time!’

source: །དེ་བཞིན་དུ་ནི་ཁྱོད་ཀྱིས་ཀྱང་། །ཞིང་འདི་ལ་ནི་རྩེ་བར་བྱོས།
en: “Likewise, you should frolic in this realm And revel in the acceptances.

source: །དེ་བཞིན་བཟོད་པ་དག་གིས་རྩེས། །བསྡམས་ནས་ཡུན་རིང་གནས་པར་བྱོས།
en: With restraint you should also Remain here for a long time!

source: །ཉན་ཐོས་ཐེག་པ་ངས་བཤད་དེ།
en: “I shall expound the vehicle of the hearers;

source: །སེམས་ཅན་ཆགས་ལས་ཐར་བྱ་ཞིང་།
en: I shall explain that beings must be liberated from attachment

source: །ཕུང་པོ་དག་དང་ཁམས་རྣམས་དང་། །སྐྱེ་མཆེད་སྟོང་པ་ངས་བཤད་དེ།
en: And that the aggregates, the elements, And the sense sources are empty.

source: །ཞི་གནས་རྣམ་པ་བཅུ་གསུམ་དང་། །ལྷག་མཐོང་ང་ཡིས་བཤད་བྱ་སྟེ།
en: “I shall expound the thirteen aspects of tranquility As well as special insight,

source: །འདོད་པའི་འཆིང་བས་དམ་བཅིངས་པའི། །སེམས་ཅན་དེ་ཡིས་རྣམ་དག་འགྱུར།
en: So that sentient beings bound by the tight fetters of desire May become pure.

source: །སེམས་ཅན་རྣམས་ལ་སྙིང་བརྩེ་བས། །ཉན་ཐོས་རྣམས་ཀྱི་བདེན་པ་བཞི།
en: “I shall explain the four truths of the hearers Out of affection for sentient beings,

source: །ཆོས་རྣམས་རྟག་ཏུ་ཡུན་གནས་དང་། །ཟག་པ་མེད་ཕྱིར་ངས་བཤད་དོ།
en: To ensure that the Dharma teachings Endure forever and remain undefiled.

source: །ཉན་ཐོས་བདེན་པས་འདུལ་བ་ནི།
en: “The hearers are tamed by the truths;

source: །སྲིད་པའི་མཚོ་ལས་ངས་བསྒྲལ་ལོ།
en: I shall free them from the ocean of saṃsāra.

source: །བྱང་ཆུབ་སྤྱོད་པ་ཐམས་ཅད་ཀྱང་། །ཕྱི་ནས་ཁྱེད་ལ་བསྟན་པར་བྱའོ།
en: Only at a later point shall I teach you All the practices of the bodhisattvas.”

source: །དེ་ནས་དེའི་ཚེ་ཐམས་ཅད་དང་ལྡན་པའི་མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ། ཀྱེ་མ་ད་ལྟར་དེ་བཞིན་གཤེགས་པ་འདི་ནི་ཉན་ཐོས་ཀྱི་གཏམ་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་མཛད་ཀྱི།
en: At that moment, all the beings present throughout the entire buddha realm of Sahā thought, “Alas, the Thus-Gone One will now give a hearers’ discourse.

source: ཐེག་པ་ཆེན་པོའི་གཏམ་ནི་མི་མཛད་དོ་སྙམ་མོ།
en: He will not give a discourse related to the Great Vehicle!”

source: །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་འདི་སྙམ་དུ་སེམས་ཏེ།
en: All the bodhisattvas thought to themselves,

source: ཀྱེ་མ་ད་ལྟར་དེ་བཞིན་གཤེགས་པ་འདི་ནི་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་ས་ཡོངས་སུ་སྤྱད་པའི་ཕྱིར་དང་། མ་འོངས་པའི་དུས་ན་ཆོས་ཀྱི་ཚུལ་རིང་དུ་གནས་པར་བྱ་བའི་ཕྱིར་དང་། ད་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གང་དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་འཆད་པར་བྱ་བའི་ཕྱིར་དང་། མ་འོངས་པའི་དུས་ན་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་མ་དད་པ་རྣམས་མངོན་པར་དད་པར་བྱ་བའི་ཕྱིར་དང་། དད་པ་རྣམས་ཕྱིར་ཞིང་འཕེལ་བར་བྱ་བའི་ཕྱིར་དང་། སེམས་ཅན་ཆོས་ལ་མངོན་པར་བརྩོན་པ་དག་དང་། ཆོས་ལ་གནས་པ་དག་དང་། ཡོན་ཏན་གྱིས་ཕྱུག་པ་དག་དང་། ཚུལ་ཁྲིམས་ཀྱི་དྲི་དང་ཡང་དག་པར་ལྡན་པ་རྣམས་བདེ་བ་ལ་རེག་པ་དང་། རྣམ་པར་ཐོ་འཚམ་པ་མེད་པར་བྱ་བའི་ཕྱིར་དང་། བྱང་གྲོལ་གྱི་བདེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་དང་། ཇི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཤིན་ཏུ་ཡོན་ཏན་དག་གིས་བསྒོ་བར་བྱ་བའི་ཕྱིར་དང་། ཕྱོགས་བཅུ་ན་གནས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་ཐམས་ཅད་ཀྱང་བསྒོ་བའི་འོས་སུ་གྱུར་པ་དང་། བླ་མ་ལ་གུས་པ་དང་། ཕྱག་བྱ་བའི་འོས་སུ་གྱུར་པར་བྱ་བའི་ཕྱིར་བདག་ཅག་ནང་དུ་ཡང་དག་པར་འཇོག་པར་བཞེད་པས།
en: “O, the Thus-Gone One wishes us to withdraw into meditative seclusion, to ensure that we subsist on the earth in this buddha realm; to ensure that the way of the Dharma remains for a long time into the future; to ensure that the lineage of the Three Jewels remains uninterrupted in this buddha realm; to ensure that in the future the gods, nāgas, yakṣas, rākṣasas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans who lack faith generate faith; to ensure that those among them who have faith develop it further and further; to ensure that those beings who strive for the Dharma, who abide by the Dharma, who possess a wealth of qualities, and who are endowed with the scent of discipline gain happiness, remain free from harm, and perfect the happiness of emancipation; to ensure that, by all means, this buddha realm becomes saturated with qualities; to ensure that all the other buddha realms of the ten directions are also worthy of such a saturation;

source: མ་ལ་བདག་ཅག་གིས་ད་དེ་བཞིན་གཤེགས་པའི་དགོངས་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་སྟེ།
en: and to ensure that the masters receive reverence and respect. O, we must now fulfill the wish of the Thus-Gone One!

source: བདག་ཅག་ཐམས་ཅད་ཀྱིས་སའི་སྟེང་དུ་སྐྱིལ་མོ་ཀྲུང་གིས་འཁོད་པར་བྱ་ཞིང་། རང་རང་གི་རྣམ་པ་སྣ་ཚོགས་ཀྱི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་བཟོད་པ་དང་། གཟུངས་དང་། ཏིང་ངེ་འཛིན་དང་། རྣལ་འབྱོར་དག་གིས་གནས་པ་དག་ཏུ་བྱ་གོར་མ་ཆག་སྙམ་མོ།
en: We must ensure that we all sit cross-legged upon this earth and abide by our various individual acceptances, dhāraṇīs, absorptions, and practices replete with the most excellent aspects!”

source: །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་བསྐལ་པ་བརྒྱས་ངེས་པར་བྱུང་བ་དག་དང་། གང་དག་ས་བཅུ་དག་དང་། གང་དག་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ལ་གནས་པའི་བར་དག་དང་། གང་དག་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ལ་གཞན་ལ་རག་མ་ལས་པའི་ཡེ་ཤེས་ལ་མཁས་པ་དག་དང་། མི་འཇིགས་པ་ཐོབ་པ་དག་གི་བར་དེ་དག་ཐམས་ཅད་ས་སྟེང་འདིར་སྐྱིལ་མོ་ཀྲུང་གིས་འཁོད་པར་གྱུར་ཏོ། །དེ་བཞིན་དུ་རང་རང་གི་རྣམ་པ་སྣ་ཚོགས་ཀྱི་མཆོག་ཐམས་ཅད་ཀྱི་བཟོད་པ་དང་། གཟུངས་དང་། ཏིང་ངེ་འཛིན་དག་ལ་མཉམ་པར་གཞག་པ་དག་ཏུ་གྱུར་ཏོ།
en: Then all the bodhisattva great beings who had reached emancipation over the course of a hundred eons, who had reached the ten levels, who abided by the acceptance of the unborn nature of phenomena, who were endowed with the eighteen unique qualities of the buddhas and were skilled in the wisdom that does not depend upon anything else, and who had reached fearlessness sat cross-legged upon the earth, and thus they settled within their individual acceptances, dhāraṇīs, and absorptions replete with the most excellent aspects.

source: །ཡང་དེའི་ཚེ་བསོད་ནམས་ཀྱི་སྟོབས་ཇི་ལྟ་བ་བཞིན་དུ་རྒྱུ་འཐུན་པའི་རྒྱུའི་སྟོབས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཉམ་པར་གཞོག་པ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་བྱེད་པ་དེ་དག་ལས་ཁ་ཅིག་གི་ལུས་ལས་འོད་འདི་ལྟ་བུ་བྱུང་སྟེ།
en: At that moment, in accordance with the strength of that merit and through the power of that concordant cause, light started to radiate from the bodies of those great bodhisattvas who were settled in equipoise and from the bodies of those great bodhisattvas who were absorbed in concentration.

source: དཔེར་ན་མར་མེའི་འོད་ལྟ་བུའོ།
en: Those lights were like the light of lamps.

source: །ཁ་ཅིག་གི་ནི་སྐར་མདའ་དང་མཉམ་པ་དག་གོ།
en: Some of those lights were equal to the light emitted by shooting stars;

source: །ཁ་ཅིག་གི་ནི་བརྒྱ་བྱིན་དང་མཉམ་པ་དག་གོ། །ཁ་ཅིག་གི་ནི་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་མཉམ་པ་ནས་ཁ་ཅིག་གི་ནི་ཟླ་བ་དང་མཉམ་པའི་བར་དག་གོ། །
en: some were equal to the light emitted by Śakra, some were equal to the light emitted by Brahmā, the lord of the Sahā world, and some were equal to the light emitted by the moon.

source: ཁ་ཅིག་གི་ནི་ཉི་མ་དང་མཉམ་པ་དག་གོ། །ཁ་ཅིག་གི་ནི་ཉི་མ་གཉིས་དང་མཉམ་པ་དག་གོ། །ཁ་ཅིག་གི་ནི་ཉི་མ་གསུམ་དང་མཉམ་པ་དག་གོ། །ཁ་ཅིག་གི་ནི་ཉི་མ་ལྔ་དང་མཉམ་པ་དག་གོ། །ཁ་ཅིག་གི་ནི་ཉི་མ་སྟོང་དང་མཉམ་པའི་བར་དག་གོ།
en: Some were equal to the light emitted by the sun, some were equal to the light emitted by two suns, some were equal to the light emitted by three suns, some were equal to the light emitted by five suns, and some were equal to the light emitted by a thousand suns.

source: །ཁ་ཅིག་གི་ནི་ལུས་ལས་ནི་ཉི་མ་བྱེ་བ་བརྒྱ་སྟོང་དང་མཉམ་པའི་འོད་དག་བྱུང་སྟེ།
en: From the bodies of some of those bodhisattvas radiated light equal to the light emitted by a trillion suns.

source: མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཐམས་ཅད་སྔོན་མ་མཐོང་མ་ཐོས་པའི་སྣང་བ་ཆེན་པོ་རྒྱ་ཆེ་བ་དེ་ལྟ་བུས་འཇིག་རྟེན་ཁྱབ་པར་གྱུར་ཏོ།
en: This far-reaching, brilliant light, which had never been seen or heard of before anywhere in this entire buddha realm of Sahā, pervaded the world.

source: །དེ་དག་གི་ལུས་ལས་མཆོག་ཏུ་སེམས་ཅན་གཞན་དག་གི་ལུས་དང་སེམས་ཀྱི་བདེ་བ་ལ་རེག་པ་དང་། དགའ་བ་དང་། རབ་ཏུ་ཚིམ་པར་བྱེད་པ།
en: From their bodies radiated a light that brought the most supreme form of bliss to the bodies and minds of sentient beings and provided delight and satisfaction.

source: ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ། ལྟ་བ་ངན་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ། ལུས་ཀྱི་གནས་ངན་ལེན་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ། བཀྲེས་པ་དང་སྐོམ་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ། འདོད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ། ཁྲོ་བ་ཐམས་ཅད་དང་། འཇིགས་པ་ཐམས་ཅད་དང་། ཉོན་མོངས་པ་དང་། འཆིང་བ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པའི་འོད་བྱུང་སྟེ།
en: This light completely pacified all diseases, completely pacified all unwholesome views, completely pacified all kinds of physical depravity, completely pacified all types of hunger and thirst, completely pacified all desires, and completely pacified all forms of aggression, fear, affliction, and bondage.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་སྲིད་པ་གསུམ་གྱི་བཙོན་རའི་སྡུག་བསྔལ་གྱི་འཇིགས་པ་ཐམས་ཅད་ཀྱི་བར་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: In this buddha realm, this light completely pacified all the fears associated with the suffering experienced in the prison of the three realms.

source: །དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ལ་འབབ་པ་དག་དང་། ཆོས་ལ་འབབ་པ་དག་དང་། དགེ་འདུན་གྱི་ཡོན་ཏན་ལ་དགའ་བ་ལ་མཁས་པ་དག་འཁོད་པར་གྱུར་ཏོ།
en: At that time, all those sentient beings—who were inclined toward the Buddha and the Dharma and skilled in delighting in the qualities of the Saṅgha—were seated in this buddha realm.

source: །ཡང་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཕྱོགས་བཅུའི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་དང་། སྟོང་པ་མ་ཡིན་པ་དག་དང་། ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་དག་པ་མ་ཡིན་པ་དག་ན་ཀུན་ནས་ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེར་ཡང་དག་པར་སྣང་བ་ནི་འདི་ལྟ་སྟེ།
en: At the same time, this buddha realm became visible, in a radiant, clear, and brilliant manner, from as many buddha realms in the ten directions as there are grains of sand in the Ganges—whether those realms were empty of buddhas or not, whether they were pure or impure.

source: མཚན་མོ་མུན་པ་བྱུང་བ་ན་ཟླ་བ་དང་། ཉི་མ་བརྒྱ་སྟོང་ཤར་ནས་ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེ་བ་བཞིན་ཏེ།
en: This buddha realm had the radiance, clarity, and brilliance of a hundred thousand moons rising in the darkness of the night.

source: དེ་ལྟར་དེའི་ཚེ་མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཕྱོགས་བཅུའི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་དང་། སྟོང་པ་མ་ཡིན་པ་དག་དང་། ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་མ་དག་པ་དག་ན་ཀུན་ནས་མཆོག་ཏུ་ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེར་གྱུར་ཏོ། །
en: In that way, this buddha realm of Sahā appeared in the most radiant, clear, and brilliant manner in buddha realms of the ten directions as numerous as the grains of sand in the Ganges—whether those realms were empty of buddhas or not, whether they were pure or impure.

source: དེ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དང་དེ་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ཡོད་པ་དང་། གང་དག་བསྐལ་པ་བརྒྱས་ངེས་པར་བྱུང་བ་དག་དང་། གང་དག་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ལ་གཞན་ལ་རག་མ་ལས་པའི་ཡེ་ཤེས་ལ་མཁས་པ་དག་དང་། མི་འཇིགས་པ་ཐོབ་པའི་བར་དེ་དག་སངས་རྒྱས་ཀྱི་མཐུས་དེ་ནས་ཆས་ཏེ། སེམས་ཀྱི་སྐད་ཅིག་མ་གཅིག་དང་ལྡན་པས་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་ཞུགས་ནས་གནས་ཇི་ལྟ་བ་བཞིན་ས་སྟེང་དུ་སྐྱིལ་མོ་ཀྲུང་གིས་འཁོད་པར་གྱུར་ཏོ།
en: Then, through the power of the Buddha, all bodhisattva great beings present in those different buddha realms who had reached emancipation over the course of a hundred eons, who were endowed with the eighteen unique qualities of the buddhas and skilled in the wisdom that does not depend on anything else, and who had reached fearlessness departed from those places, entered this buddha realm in a single instant of thought, and sat cross-legged upon the earth in their respective ways of abiding.

source: །དེ་བཞིན་དུ་རང་རང་གི་དགེ་བའི་ཕྱོགས་ལ་ནན་ཏན་དག་ཏུ་བྱེད་ཅིང་ཇི་ལྟར་དགེ་བའི་ཕྱོགས་ཀྱི་སྟོབས་བསྐྱེད་པ་ཐོབ་པ་དེ་དག་དང་། མི་འཇིགས་པའི་རྒྱུ་དང་རྐྱེན་དང་ལྡན་པ་དེ་དག་གི་ལུས་ལས་དེ་འདྲ་བ་ཁོ་ནའི་འོད་བྱུང་བར་གྱུར་ཏོ།
en: The exact same lights radiated from the bodies of each of those beings who exerted themselves in virtuous endeavors, who had developed the power of virtue, and who were endowed with the causes and conditions of fearlessness.
